# SetRebarShapeId Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarShapeDrivenAccessor..::..SetRebarShapeId Method
RebarShapeDrivenAccessor Class See Also
---
Changes the RebarShape element that defines the shape of the rebar. Changing the value of this member causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetRebarShapeId(
	ElementId shapeId
)
```

Visual Basic
---
```text
Public Sub SetRebarShapeId ( _
	shapeId As ElementId _
)
```

Visual C++
---
```text
public:
void SetRebarShapeId(
	ElementId^ shapeId
)
```

# ### Parameters
shapeId
    Type: Autodesk.Revit.DB..::..ElementId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | shapeId is not the id of a RebarShape in the document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace